#include<iostream>
#include<cstring>
#include<WinSock2.h>
using namespace std;
class App {
public:
	void start();
};
void App::start() {
	cout << "===============< 채팅 클라이언트 프로그램 >=================\n"
		"============================================================\n"
		"====\t\t\t\t\t\t\t====\n"
		"====\tVersion : v1.0.0\t\t\t\t====\n"
		"====\t\t\t\t\t\t\t====\n"
		"====\tTitle : 오픈 채팅방 만들기\t\t\t====\n"
		"====\t\t\t\t\t\t\t====\n"
		"====\tContent : C++ 채팅 프로그램 예제를 통해\t\t====\n"
		"====\t\t버전 업그레이드 하여 오픈 채팅방\t====\n"
		"====\t\t까지 만드는 것이 목표\t\t\t====\n"
		"====\t\t\t\t\t\t\t====\n"
		"============================================================\n"
		"============================================================\n";
}

int main() {
	App app;
	app.start();
}